#pragma once


////////////////////////////////////////////////////////////////////////////////
//
//	時間計測
//
////////////////////////////////////////////////////////////////////////////////
class TimeCounter
{
public:
	TimeCounter( pstr pText );
	~TimeCounter();

private:
	String32		m_Text;
	LARGE_INTEGER	m_StartTime;
};

////////////////////////////////////////////////////////////////////////////////
//
//	時間計測（登録型）
//
////////////////////////////////////////////////////////////////////////////////
class TimeCounter_Reg
{
public:
	TimeCounter_Reg( int ID );
	~TimeCounter_Reg();

private:
	int				m_ID;
	LARGE_INTEGER	m_StartTime;
};


//------------------------------------------------------------------------------
//	登録された計測時間を書き出しリセット
//------------------------------------------------------------------------------
void FlushTimeReg( int ID, pstr pText );


//------------------------------------------------------------------------------
//	計測用マクロ
//------------------------------------------------------------------------------
#define TIMECOUNT( p )		TimeCounter TimeCounter##__LINE__( p )
#define TIMECOUNT_REG( n )	TimeCounter_Reg TimeCounter_Reg##__LINE__( n )
