#pragma once


////////////////////////////////////////////////////////////////////////////////
//
//	リプレイ：型定義
//
////////////////////////////////////////////////////////////////////////////////

//------------------------------------------------------------------------------
//	リプレイ：定数
//------------------------------------------------------------------------------
const dword		REPLAY_FORMAT					= MAKELONG( MAKEWORD('L','S'), MAKEWORD('R','P') );
const uint		REPLAY_VERSION					= 0;
const int		REPLAY_FILE_MAX					= 10;


//------------------------------------------------------------------------------
//	リプレイ：データヘッダ
//------------------------------------------------------------------------------
struct REPLAY_HEADER
{
	dword		Format;
	uint		Version;
	char		DateTime[20];

	uint		FrameCount;
	uint		EventNum;

	uint		PlayID;
	int			Arrival;
	uint		Score;
	uint		ContinueCount;
	uint		OverwriteCount;

	byte		Padding[32];
};

//------------------------------------------------------------------------------
//	リプレイ：イベントタイプ
//------------------------------------------------------------------------------
enum REPLAY_EVENT_TYPE
{
	REPLAY_EVENT_CHANGE_STAGE,
};

//------------------------------------------------------------------------------
//	リプレイ：イベント
//------------------------------------------------------------------------------
struct REPLAY_EVENT
{
	uint		Frame;
	uint		Type;

	union
	{
		int		ParamInt[2];
		float	ParamFloat[2];
		char	ParamStr[8];
	};
};