#include "stdafx.h"
#include "Scene.h"
#include "SceneManager.h"


///////////////////////////////////////////////////////////////////////////////
//
//	シーン基底
//
///////////////////////////////////////////////////////////////////////////////
Scene::Scene( Label Name )
{
	m_pSceneManager	= NULL;
	m_Name			= Name;
}

//*****************************************************************************
//	シーンを終了
//*****************************************************************************
void Scene::Exit( void )
{
	_ASSERT( m_pSceneManager );
	m_pSceneManager->Exit();
}

//*****************************************************************************
//	シーンの変更
//*****************************************************************************
void Scene::ChangeScene( Scene* pScene )
{
	_ASSERT( m_pSceneManager && pScene );

	m_pSceneManager->ChangeScene( pScene );
}