#include "P5.h"
#include "SoundFile.h"


namespace P5
{

////////////////////////////////////////////////////////////////////////////////
//
//	サウンドファイル
//
////////////////////////////////////////////////////////////////////////////////
SoundFile::SoundFile( void )
{
}
SoundFile::~SoundFile()
{
	
}

//******************************************************************************
//	読み込み
//******************************************************************************
bool SoundFile::Load( pstr pPath )
{
	m_Path	= pPath;
	m_Name	= GetFileTitle<256>( pPath );

	//	読み込み処理
	return _OnLoad();
}

};