#include "stdafx.h"
#include "ScoreTypes.h"


////////////////////////////////////////////////////////////////////////////////
//
//	スコア：型定義
//
////////////////////////////////////////////////////////////////////////////////

//******************************************************************************
//	スコア：レートパラメータ
//******************************************************************************
SCORE_RATE::SCORE_RATE( void )
{
	RateMin		= 0.0f;
	RateMax		= 0.0f;
	
	RateLow		= 0.0f;
	RateHigh	= 0.0f;
}

//******************************************************************************
//	スコア：ヒートパラメータ
//******************************************************************************
SCORE_HEAT::SCORE_HEAT( void )
{
	HeatMin			= 0.0f;
	HeatMax			= 0.0f;
	RatePlusMin		= 0.0f;
	RatePlusMax		= 0.0f;
	RateMinusMin	= 0.0f;
	RateMinusMax	= 0.0f;
}

//******************************************************************************
//	スコアパラメータ
//******************************************************************************
SCORE_PARAM::SCORE_PARAM( void )
{
	ScoreBase	= 100;
	ScoreMax	= 999999999;
}

//******************************************************************************
//	スコア・ステージ記録
//******************************************************************************
void SCORE_STAGE_RECORD::Reset( void )
{
	Score			= 0;
	Rate			= 0.0f;
	Heat			= 0.0f;

	ItemCount		= 0;
	DestroyCount	= 0;
	FrameCount		= 0;

	DamageCount		= 0;
	BreakCount		= 0;
	ContinueCount	= 0;
	MissCount		= 0;
	CrashCount		= 0;
	ItemLostCount	= 0;
}

//------------------------------------------------------------------------------
//	比較
//------------------------------------------------------------------------------
bool SCORE_STAGE_RECORD::operator !=( const SCORE_STAGE_RECORD& r )
{
	return	Score			!= r.Score			||
			Rate			!= r.Rate			||
			Heat			!= r.Heat			||

			ItemCount		!= r.ItemCount		||
			DestroyCount	!= r.DestroyCount	||
			FrameCount		!= r.FrameCount;
}
